const districtAreas = {
    "Благоевград": ["Център", "Еленово", "Струмско", "Запад", "Грамада"],
    "Бургас": ["Възраждане", "Братя Миладинови", "Зорница", "Изгрев", "Лазур", "Меден Рудник", "Сарафово"],
    "Варна": ["Аспарухово", "Възраждане", "Виница", "Младост", "Одесос", "Приморски", "Чайка"],
    "ВеликоТърново": ["Център", "Асенов", "Акация", "Картала", "Бузлуджа", "Чолаковци"],
    "Видин": ["Център", "Баба Тонка", "Бонония", "Калето", "Кумбаир", "Панония"],
    "Враца": ["Център", "Дъбника", "Металург", "Околчица", "Сениче"],
    "Габрово": ["Център", "Бичкиня", "Велчевци", "Голо бърдо", "Младост", "Трендафил"],
    "Добрич": ["Център", "Балик", "Дружба", "Иглика", "Изгрев", "Простор", "Строител", "Христо Ботев"],
    "Кърджали": ["Възрожденци", "Веселчане", "Гледка", "Орфей", "Студен кладенец", "Байкал"],
    "Кюстендил": ["Център", "Бузлуджа", "Запад", "Герена", "Колуша"],
    "Ловеч": ["Център", "Вароша", "Гозница", "Младост", "Здравец", "Червен бряг"],
    "Монтана": ["Център", "Младост", "Парта", "Жерави", "Плиска"],
    "Пазарджик": ["Център", "Запад", "Младост", "Устрем", "Ябълките"],
    "Перник": ["Център", "Изток", "Мошино", "Тева", "Рено", "Калкас"],
    "Плевен": ["Център", "Дружба", "Сторгозия", "Мара Денчева", "Кайлъка"],
    "Пловдив": ["Център", "Южен", "Западен", "Източен", "Северен", "Тракия", "Смирненски"],
    "Разград": ["Център", "Орел", "Абритус", "Васил Левски", "Воден"],
    "Русе": ["Център", "Възраждане", "Дружба", "Здравец", "Родина", "Средна кула", "Чародейка"],
    "Силистра": ["Център", "Запад", "Деленки", "Дръстър", "Изток"],
    "Сливен": ["Център", "Даме Груев", "Комлука", "Ново село", "Речица"],
    "Смолян": ["Център", "Невястата", "Нов център", "Райково", "Устово"],
    "София": ["Център", "Лозенец", "Младост", "Надежда", "Обеля", "Овча купел", "Люлин", "Дружба", "Слатина", "Възраждане", "Красно село", "Витоша"],
    "СтараЗагора": ["Център", "Зора", "Казански", "Три чучура", "Аязмото"],
    "Търговище": ["Център", "Боровец", "Вароша", "Запад", "Младост"],
    "Хасково": ["Център", "Орфей", "Бадема", "Кенана", "Училищни", "Червена стена"],
    "Шумен": ["Център", "Добруджански", "Тракия", "Боян Българанов", "Дивдядово"],
    "Ямбол": ["Център", "Златен рог", "Граф Игнатиев", "Георги Бенковски", "Каргон", "Христо Ботев"]
};

document.getElementById("DistrictDropdown").addEventListener("change", function () {
    const selectedDistrict = this.value.replace(/\s+/g, '');
    const areas = districtAreas[selectedDistrict] || [];

    const areaDropdown = document.getElementById("NeighbourhoodDropdown");
    areaDropdown.innerHTML = "";

    areas.forEach(function (area) {
        const option = document.createElement("option");
        option.value = area;
        option.text = area;
        areaDropdown.appendChild(option);
    });
});